W11D5/benchbnb copy/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "bV1i_GbvPqy-aKFPHM0GPg"], ["updated_at", "2021-04-02 00:25:00.072069"], ["id", 1]]
---
  def reset_session_token!
    # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
    self.session_token = SecureRandom.urlsafe_base64
    self.save